tap "equalsraf/neovim-qt"
tap "felixkratz/formulae"
tap "hamed-elfayome/claude-usage"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "jetbrains/utils"
tap "jstkdng/programs"
tap "koekeishiya/formulae"
tap "maciejwalkowiak/brew"
tap "nikitabobko/tap"
tap "omnisharp/omnisharp-roslyn"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "oven-sh/bun"
tap "qmk/qmk"
tap "sst/tap"
tap "testingisdocumenting/brew"
tap "wimdeblauwe/ttcli"
brew "xz"
brew "jpeg-xl"
brew "asitop"
brew "aspell"
brew "ast-grep"
brew "autojump"
brew "cairo"
brew "harfbuzz"
brew "aws-google-auth"
brew "awscli"
brew "backlog-md"
brew "bat"
brew "openjdk"
brew "bfg"
brew "bottom"
brew "brightness"
brew "broot"
brew "caddy"
brew "pycparser"
brew "cffi"
brew "pango"
brew "cheat"
brew "ruby"
brew "cocoapods"
brew "commitizen"
brew "coreutils"
brew "ctags"
brew "curl"
brew "diff-so-fancy"
brew "docker"
brew "doxx"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "libarchive"
brew "ffmpegthumbnailer"
brew "libtool"
brew "fzf"
brew "gawk"
brew "gdu"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"
brew "git-machete"
brew "gitleaks"
brew "glow"
brew "go"
brew "gradle"
brew "graphicsmagick"
brew "graphviz"
brew "h2"
brew "pkgconf"
brew "htop"
brew "httpie"
brew "httpstat"
brew "hurl"
brew "icdiff"
brew "libusbmuxd", args: ["HEAD"]
brew "libimobiledevice", args: ["HEAD"]
brew "ideviceinstaller"
brew "imagemagick"
brew "ios-deploy"
brew "jdtls"
brew "jira-cli"
brew "jq"
brew "kdoctor"
brew "keychain"
brew "lazygit"
brew "leveldb"
brew "llm"
brew "lsd"
brew "lua"
brew "lua-language-server"
brew "luajit"
brew "luarocks"
brew "macvim"
brew "markdown-oxide"
brew "maven"
brew "mdbook"
brew "mole"
brew "mysql-client"
brew "navi"
brew "neovim"
brew "neovim-qt"
brew "ripgrep"
brew "opencode"
brew "openjdk@21"
brew "pandoc"
brew "php"
brew "pngpaste"
brew "poppler"
brew "postgresql@14"
brew "powerlevel10k"
brew "py3cairo"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "ripgrep-all"
brew "rust"
brew "rust-analyzer"
brew "saml2aws"
brew "scipy"
brew "stow"
brew "terminal-notifier"
brew "thefuck"
brew "tlrc"
brew "tmux"
brew "tokyo-cabinet"
brew "trash"
brew "tree"
brew "truncate", link: false
brew "unar"
brew "up"
brew "uv"
brew "vivid"
brew "watch"
brew "wget"
brew "xclip"
brew "yaml-language-server"
brew "yazi"
brew "yt-dlp"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "jetbrains/utils/kotlin-lsp"
brew "jstkdng/programs/ueberzugpp"
brew "koekeishiya/formulae/skhd"
brew "maciejwalkowiak/brew/just"
brew "omnisharp/omnisharp-roslyn/omnisharp-mono"
brew "oven-sh/bun/bun"
brew "qmk/qmk/qmk"
brew "testingisdocumenting/brew/webtau"
cask "nikitabobko/tap/aerospace"
cask "claude-code"
cask "hamed-elfayome/claude-usage/claude-usage-tracker"
cask "devtoys"
cask "fig"
cask "font-batang"
cask "font-carrois-gothic"
cask "font-meslo-lg-nerd-font"
cask "font-sarasa-gothic"
cask "font-sf-pro"
cask "ghostty"
cask "gureumkim"
cask "hammerspoon"
cask "jordanbaird-ice"
cask "keycastr"
cask "mactex-no-gui"
cask "ngrok"
cask "orbstack"
cask "qlmarkdown"
cask "qmk-toolbox"
cask "rectangle"
cask "sf-symbols"
cask "wkhtmltopdf"
cask "youtype"
cask "zed"
go "github.com/danielmiessler/fabric"
go "github.com/danielmiessler/fabric/plugins/tools/to_pdf"
cargo "cargo-generate"
cargo "create-tauri-app"
cargo "obsidian-lsp"
