tap "atlassian/acli"
tap "databricks/tap"
tap "detachhead/tap"
tap "dlvhdr/formulae"
tap "f/textream"
tap "felixkratz/formulae"
tap "graykode/tap"
tap "hamed-elfayome/claude-usage"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "jetbrains/utils"
tap "jstkdng/programs"
tap "koekeishiya/formulae"
tap "maciejwalkowiak/brew"
tap "nikitabobko/tap"
tap "njbrake/aoe"
tap "omnisharp/omnisharp-roslyn"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "oven-sh/bun"
tap "qmk/qmk"
tap "testingisdocumenting/brew"
# General-purpose data compression with high compression ratio
brew "xz"
# Perf monitoring CLI tool for Apple Silicon
brew "asitop"
# Code searching, linting, rewriting
brew "ast-grep"
# Shell extension to jump to frequently used directories
brew "autojump"
# Vector graphics library with cross-device output support
brew "cairo"
# OpenType text shaping engine
brew "harfbuzz"
# New file format for still image compression
brew "jpeg-xl"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Acquire AWS credentials using Google Apps
brew "aws-google-auth"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Development kit for the Java programming language
brew "openjdk"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# New way to see and navigate directory trees
brew "broot"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Defines a standard way of committing rules and communicating it
brew "commitizen"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Multi-format archive and compression library
brew "libarchive"
# Framework for layout and rendering of i18n text
brew "pango"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Lock file during command
brew "flock"
# Generic library support script
brew "libtool"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Git repository organizer & rebase workflow automation tool
brew "git-machete"
# Audit git repos for secrets
brew "gitleaks"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Ping, but with a graph
brew "gping"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Image processing tools collection
brew "graphicsmagick"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Command-line tool for generating regular expressions
brew "grex"
# Java SQL database
brew "h2"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Curl statistics made simple
brew "httpstat"
# Run and Test HTTP Requests with plain text and curl
brew "hurl"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Java language specific implementation of the Language Server Protocol
brew "jdtls"
# Feature-rich interactive Jira CLI
brew "jira-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# Simple terminal UI for git commands
brew "lazygit"
# Access large language models from the command-line
brew "llm"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Powerful, lightweight programming language
brew "lua"
# Language Server for the Lua language
brew "lua-language-server"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Personal Knowledge Management System for the LSP
brew "markdown-oxide"
# Java-based project management
brew "maven"
# Create modern online books from Markdown files
brew "mdbook"
# Deep clean and optimize your Mac
brew "mole"
# Open source relational database management system
brew "mysql-client"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Development kit for the Java programming language
brew "openjdk@21"
# Swiss-army knife of markup format conversion
brew "pandoc"
# General-purpose scripting language
brew "php"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Paste PNG into files
brew "pngpaste"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14"
# Theme for zsh
brew "powerlevel10k"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: false
# Safe, concurrent, practical language
brew "rust"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"
# Software for mathematics, science, and engineering
brew "scipy"
# SOund eXchange: universal sound sample translator
brew "sox"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Programmatically correct mistyped console commands
brew "thefuck"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Lightweight database library
brew "tokyo-cabinet"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Truncates a file to a given size
brew "truncate", link: false
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Language Server for Yaml Files
brew "yaml-language-server"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Utilities designed to make common development tasks easier
cask "devtoys"
cask "font-batang"
cask "font-carrois-gothic"
cask "font-meslo-lg-nerd-font"
cask "font-sarasa-gothic"
cask "font-sf-pro"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Libhangul-based keyboard input
cask "gureumkim"
# Desktop automation application
cask "hammerspoon"
# Menu bar manager
cask "jordanbaird-ice"
# Open-source keystroke visualiser
cask "keycastr"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Replacement for Docker Desktop
cask "orbstack"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# macOS teleprompter that highlights your script in real-time as you speak
cask "f/textream/textream"
# HTML to PDF renderer
cask "wkhtmltopdf"
# Input method helper
cask "youtype"
# Multiplayer code editor
cask "zed"
vscode "baryon.baryon-markdown-live-preview"
vscode "biomejs.biome"
vscode "cschlosser.doxdocgen"
vscode "eamodio.gitlens"
vscode "foam.foam-vscode"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "marp-team.marp-vscode"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azure-mcp-server"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-containers"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sonarsource.sonarlint-vscode"
vscode "teamsdevapp.vscode-ai-foundry"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "willasm.obsidian-md-vsc"
go "github.com/danielmiessler/fabric"
go "github.com/danielmiessler/fabric/plugins/tools/to_pdf"
cargo "agf"
cargo "cargo-generate"
cargo "create-tauri-app"
cargo "obsidian-lsp"
cargo "recon"
npm "@2fd/graphdoc"
npm "@aisuite/chub"
npm "@bchatard/alfred-jetbrains"
npm "@decipher-sdk/decipher-qa"
npm "@openai/codex"
npm "@stoplight/prism-cli"
npm "@vtsls/language-server"
npm "axios"
npm "az.dev"
npm "ccusage"
npm "claude-code-watcher"
npm "claude-task-viewer"
npm "cz-emoji-conventional"
npm "cz-emoji"
npm "generator-jhipster"
npm "graphql"
npm "kqmd"
npm "llm-checker"
npm "markdown-preview"
npm "markdownlint-cli"
npm "n"
npm "netlify-cli"
npm "pnpm"
npm "portless"
npm "prettier"
npm "surf-cli"
npm "ts-jest"
npm "tslib"
npm "typescript"
npm "yarn"
npm "yo"

# --- preserved: brew bundle dump (Homebrew 6.x) drops these still-installed tap formulae ---
brew "atlassian/acli/acli"
brew "databricks/tap/databricks"
brew "dlvhdr/formulae/diffnav"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "graykode/tap/abtop"
brew "jetbrains/utils/kotlin-lsp"
brew "jstkdng/programs/ueberzugpp"
brew "koekeishiya/formulae/skhd"
brew "maciejwalkowiak/brew/just"
brew "njbrake/aoe/aoe"
brew "omnisharp/omnisharp-roslyn/omnisharp-mono"
brew "oven-sh/bun/bun"
brew "qmk/qmk/qmk"
brew "testingisdocumenting/brew/webtau"
