tap "equalsraf/neovim-qt"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "maciejwalkowiak/brew"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "testingisdocumenting/brew"
tap "wimdeblauwe/ttcli"
brew "xz"
brew "jpeg-xl"
brew "asitop"
brew "aspell"
brew "autojump"
brew "pycparser"
brew "cffi"
brew "awscli"
brew "bat"
brew "bottom"
brew "brightness"
brew "caddy"
brew "cairo"
brew "cheat"
brew "cmatrix"
brew "ruby"
brew "cocoapods"
brew "commitizen"
brew "coreutils"
brew "ctags"
brew "ctop"
brew "curl"
brew "dart-sdk"
brew "diff-so-fancy"
brew "docker"
brew "duf"
brew "dust"
brew "exa"
brew "eza"
brew "fd"
brew "harfbuzz"
brew "libarchive"
brew "pango"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "figlet"
brew "fish"
brew "libtool"
brew "fzf"
brew "gawk"
brew "gdu"
brew "ghi"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "git-machete"
brew "glow"
brew "go"
brew "openjdk"
brew "gradle"
brew "graphicsmagick"
brew "graphviz"
brew "h2"
brew "httpie"
brew "httpstat"
brew "hub"
brew "hurl"
brew "icdiff"
brew "libusbmuxd", args: ["HEAD"]
brew "libimobiledevice", args: ["HEAD"]
brew "ideviceinstaller"
brew "imagemagick"
brew "ios-deploy"
brew "jq"
brew "kdoctor"
brew "keychain"
brew "leveldb"
brew "llm"
brew "lsd"
brew "luarocks"
brew "macvim"
brew "mame"
brew "maven"
brew "mysql-client"
brew "navi"
brew "neovim"
brew "neovim-qt"
brew "pandoc"
brew "php", restart_service: :changed
brew "pkgconf"
brew "pngpaste"
brew "poppler"
brew "postgresql@14"
brew "powerlevel10k"
brew "py3cairo"
brew "pyenv"
brew "pyenv-virtualenv"
brew "r"
brew "ruby-build"
brew "rbenv"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "ripgrep-all"
brew "rust"
brew "saml2aws"
brew "scipy"
brew "stow"
brew "texlive"
brew "the_silver_searcher"
brew "thefuck"
brew "tlrc"
brew "tmux"
brew "tokyo-cabinet"
brew "tree"
brew "truncate", link: false
brew "unar"
brew "up"
brew "walk"
brew "wget"
brew "xclip"
brew "yazi"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "jesseduffield/lazygit/lazygit"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "maciejwalkowiak/brew/just"
brew "qmk/qmk/qmk"
brew "testingisdocumenting/brew/webtau"
brew "wimdeblauwe/ttcli/ttcli"
cask "aerospace"
cask "anaconda"
cask "cakebrew"
cask "devtoys"
cask "fig"
cask "flutter"
cask "font-meslo-lg-nerd-font"
cask "font-sarasa-gothic"
cask "font-sf-pro"
cask "ghostty"
cask "hammerspoon"
cask "keycastr"
cask "kitty"
cask "mactex-no-gui"
cask "ngrok"
cask "orbstack"
cask "qmk-toolbox"
cask "rectangle"
cask "sf-symbols"
cask "wezterm"
cask "wkhtmltopdf"
cask "youtype"
cask "zed"
